app/controllers/rscripts_controller.rb

  def index
    @rscripts = Rscript.all
---
SELECT "rscripts".* FROM "rscripts"

  def create
    @rscript = Rscript.new(rscript_params)

    respond_to do |format|
      if @rscript.save
---
INSERT INTO "rscripts" ("title", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def update
    respond_to do |format|
      if @rscript.update(rscript_params)
---
UPDATE "rscripts" SET "title" = ?, "code" = ?, "updated_at" = ? WHERE "rscripts"."id" = ?

    def set_rscript
      @rscript = Rscript.find(params[:id])
---
SELECT  "rscripts".* FROM "rscripts" WHERE "rscripts"."id" = ? LIMIT 1  [["id", 1]]